name: "query_classify_tokenizer"
max_batch_size: 64
backend: "python"

input [
    {
        name: "text"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "token_type_ids"
        data_type: TYPE_INT64
        dims: [ 64 ] 
    },
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [ 64 ] 
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [ 64 ]
    }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]