name: "clip_image_preprocessor"
max_batch_size: 64
backend: "python"

input [
    {
        name: "image_url"
        data_type: TYPE_STRING
        dims: [ 1 ]
    }
]

output [
    {
        name: "pixel_values"
        data_type: TYPE_FP32
        dims: [ 3, 244, 244 ] 
    }
]

dynamic_batching {
#   preferred_batch_size: [ 1,2,4,8,16,32,64 ]
#   max_queue_delay_microseconds: 5
}

instance_group [
    {
      count: 2
      kind: KIND_CPU
    }
]