name: "query_classify_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 64
input [
  {
    name: "token_type_ids"
    data_type: TYPE_INT64
    dims: [64]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [64]
  },
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [64]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [6038]
  }
]
dynamic_batching {
  preferred_batch_size: [ 1,2,4,8,16,32,64 ]
  max_queue_delay_microseconds: 5
}
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
version_policy: { latest { num_versions : 1 }}
optimization {
  graph { level: 1 }
}