name: "query_classify_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 64
input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [6038]
  }
]
dynamic_batching {
  # preferred_batch_size: [ 1,2,4,8,16,32,64 ]
  # max_queue_delay_microseconds: 5
}
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
version_policy: { latest { num_versions : 1 }}
optimization {
  graph { level: 3 }
  execution_accelerators {
    gpu_execution_accelerator : [ {
      name : "tensorrt"
      parameters { key: "precision_mode" value: "FP16" }
      parameters { key: "max_workspace_size_bytes" value: "1073741824" }
      }]
  }
}

model_warmup [
  {
      name : "query_classify_onnx_warmup_batch_size_1"
      batch_size: 1
      inputs [
        {
          key: "input_ids"
          value: {
              data_type: TYPE_INT64
              dims: 50
              zero_data: true
          }
        },
        {
          key: "attention_mask"
          value: {
              data_type: TYPE_INT64
              dims: 50
              zero_data: true
          }
        }
      ]
  },
  {
      name : "query_classify_onnx_warmup_batch_size_64"
      batch_size: 64
      inputs [
        {
          key: "input_ids"
          value: {
              data_type: TYPE_INT64
              dims: 50
              zero_data: true
          }
        },
        {
          key: "attention_mask"
          value: {
              data_type: TYPE_INT64
              dims: 50
              zero_data: true
          }
        }
      ]
  }
]
