name: "clip_image_ensemble"
# maximum batch size 
max_batch_size: 64
platform: "ensemble"

#input to the model 
input [
    {
        name: "image_url"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    }
]

#output of the model 
output [
    {
        name: "pooler_output"
        data_type: TYPE_FP32
        dims: [ 512 ] 
    },
    {
        name: "image_download_success"
        data_type: TYPE_BOOL 
        dims: [ 1 ]
    }
]

#Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "clip_image_preprocessor"
            model_version: -1
            input_map [{
                key: "image_url"
                value: "image_url"
            }]
            output_map [
                {
                    key: "pixel_values"
                    value: "pixel_values"
                },
                {
                    key: "image_download_success"
                    value: "image_download_success"
                }
            ]
        },
        {
            model_name: "clip_image_onnx"
            model_version: -1
            input_map [{
                key: "pixel_values"
                value: "pixel_values"
            }]
            output_map [{
                key: "pooler_output"
                value: "pooler_output"
            }]
        }
    ]
}