name: "product_collection_keyword2annresponse_ensemble"
# maximum batch size 
max_batch_size: 64
platform: "ensemble"

#input to the model 
input [
    {
        name: "text"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    }
]

#output of the model 
output [
    {
        name: "responses"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    },
    {
        name: "success"
        data_type: TYPE_BOOL
        dims: [ 1 ] 
    }
]

#Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "clip_text_ensemble"
            model_version: -1
            input_map [{
                key: "text"
                value: "text"
            }]
            output_map [{
                key: "embs"
                value: "embs_clip_text"
            }]
        },
        {
            model_name: "product_collection_emb2annrequest"
            model_version: -1
            input_map [{
                key: "embs"
                value: "embs_clip_text"
            }]
            output_map [
                {
                    key: "embs"
                    value: "embs_annrequest"
                },
                {
                    key: "collections"
                    value: "collections"
                },
                {
                    key: "limits"
                    value: "limits"
                }
            ]
        },
        {
            model_name: "ann_search"
            model_version: -1
            input_map [
                {
                    key: "embs"
                    value: "embs_annrequest"
                },
                {
                    key: "collections"
                    value: "collections"
                },
                {
                    key: "limits"
                    value: "limits"
                }
            ]
            output_map [
                {
                    key: "responses"
                    value: "responses"
                },
                {
                    key: "success"
                    value: "success"
                }
            ]
        }
    ]
}