name: "query_classify_postprocess"
max_batch_size: 64
backend: "python"

input [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ 6038 ]
    }
]

output [
    {
        name: "categories"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    },
    {
        name: "weights"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]