name: "text_emb_ensemble"
# maximum batch size 
max_batch_size: 64
platform: "ensemble"

#input to the model 
input [
    {
        name: "text"
        data_type: TYPE_STRING
        dims: [ 1 ] 
    }
]

#output of the model 
output [
    {
        name: "embs"
        data_type: TYPE_FP32
        dims: [ 768 ] 
    }
]

#Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "text_emb_tokenizer"
            model_version: -1
            input_map [{
                key: "text"
                value: "text"
            }]
            output_map [
                {
                    key: "input_ids"
                    value: "input_ids"
                },
                {
                    key: "attention_mask"
                    value: "attention_mask"
                }
            ]
        },
        {
            model_name: "text_emb_onnx"
            model_version: -1
            input_map [
                {
                    key: "input_ids"
                    value: "input_ids"
                },
                {
                    key: "attention_mask"
                    value: "attention_mask"
                }
            ]
            output_map [{
                key: "embs"
                value: "embs"
            }]
        }
    ]
}